from random import choice
def generate_dayplopynamepart_russian():
    CONSONTANTS =          ['б', 'в', 'г', 'д', 'ж', 'з', 'л', 'м', 'н', 'р',
                            'б', 'в', 'г', 'д', 'ж', 'з', 'л', 'м', 'н', 'р',
                            'б', 'в', 'г', 'д', 'ж', 'з', 'л', 'м', 'н', 'р',
                            'й', 'к', 'п', 'с', 'т', 'ф', 'х', 'ц', 'ч', 'ш']
    VOWELS =               ['а', 'и', 'о', 'у', 'е',
                            'а', 'и', 'о', 'у', 'е',
                            'а', 'и', 'о', 'у', 'е',
                            'а', 'и', 'о', 'у', 'е',
                            'э', 'ы', 'ё', 'ю', 'я']
    LEFTCOMBOS =           ['рб', 'сб', 'фб', 'хб', 'шб',
                            'бв', 'гв', 'дв', 'жв', 'зв', 'кв', 'мв', 'нв', 'пв', 'рв', 'св', 'тв', 'фв', 'хв', 'цв', 'чв', 'шв',
                            'зг', 'мг', 'рг', 'сг', 'фг', 'хг', 'цг', 'чг',
                            'вд', 'жд', 'зд', 'мд', 'нд', 'рд', 'сд', 'фд', 'хд',
                            'вж', 'гж', 'дж', 'кж', 'лж', 'мж', 'нж', 'пж', 'рж', 'сж', 'тж', 'фж', 'хж', 'чж',
                            'вз', 'гз', 'дз', 'кз', 'лз', 'мз', 'нз', 'пз', 'рз', 'сз', 'тз', 'фз', 'хз', 'цз', 'чз',
                            'зк', 'мк', 'нк', 'пк', 'рк', 'ск', 'тк', 'фк', 'хк', 'цк', 'чк', 'шк',
                            'бл', 'вл', 'гл', 'дл', 'жл', 'зл', 'кл', 'мл', 'нл', 'пл', 'рл', 'сл', 'тл', 'фл', 'хл', 'цл', 'чл', 'шл',
                            'вм', 'гм', 'дм', 'жм', 'зм', 'км', 'лм', 'нм', 'рм', 'см', 'тм', 'фм', 'хм', 'цм', 'чм', 'шм',
                            'вн', 'гн', 'дн', 'жн', 'зн', 'кн', 'лн', 'мн', 'пн', 'рн', 'сн', 'тн', 'фн', 'хн', 'цн', 'чн', 'шн',
                            'вп', 'кп', 'нп', 'рп', 'сп', 'тп', 'фп', 'хп', 'цп', 'чп', 'шп',
                            'бр', 'вр', 'гр', 'др', 'жр', 'зр', 'кр', 'мр', 'нр', 'пр', 'ср', 'тр', 'фр', 'хр', 'цр', 'чр', 'шр',
                            'бс', 'вс', 'кс', 'лс', 'мс', 'нс', 'пс', 'рс', 'тс', 'фс', 'хс', 'шс',
                            'вт', 'кт', 'лт', 'мт', 'нт', 'пт', 'рт', 'ст', 'фт', 'хт', 'цт', 'чт', 'шт',
                            'дф', 'кф', 'мф', 'нф', 'пф', 'рф', 'сф', 'тф', 'хф', 'цф', 'чф', 'шф',
                            'бх', 'вх', 'гх', 'дх', 'кх', 'лх', 'мх', 'нх', 'пх', 'рх', 'сх', 'тх', 'фх', 'цх', 'чх', 'шх',
                            'гц', 'лц', 'мц', 'нц', 'пц', 'рц', 'сц', 'тц', 'фц', 'шц',
                            'вч', 'гч', 'мч', 'нч', 'пч', 'рч', 'сч', 'тч', 'фч', 'шч',
                            'бш', 'вш', 'гш', 'кш', 'лш', 'мш', 'нш', 'пш', 'рш', 'сш', 'тш', 'фш']
    RIGHTCOMBOS =          ['жб', 'зб', 'йб', 'лб', 'мб', 'нб', 'рб',
                            'дв', 'зв', 'йв', 'кв', 'лв', 'нв', 'рв',
                            'вг', 'гг', 'жг', 'зг', 'йг', 'лг', 'мг', 'нг', 'рг', 'сг', 'фг', 'хг', 'шг',
                            'дд', 'жд', 'зд', 'йд', 'лд', 'мд', 'нд', 'рд', 'сд', 'фд', 'хд', 'шд',
                            'вж', 'гж', 'дж', 'жж', 'кж', 'лж', 'мж', 'нж', 'рж', 'тж',
                            'вз', 'гз', 'дз', 'зз', 'йз', 'кз', 'лз', 'мз', 'нз', 'пз', 'рз', 'тз', 'хз',
                            'вк', 'жк', 'зк', 'йк', 'кк', 'лк', 'мк', 'нк', 'рк', 'ск', 'фк', 'хк', 'цк', 'чк', 'шк',
                            'зл', 'йл', 'кл', 'лл', 'пл', 'сл', 'тл', 'фл', 'цл', 'чл', 'шл',
                            'жм', 'зм', 'йм', 'км', 'лм', 'мм', 'рм', 'см', 'тм', 'фм', 'хм', 'цм', 'чм', 'шм',
                            'бн', 'вн', 'гн', 'дн', 'жн', 'зн', 'йн', 'кн', 'лн', 'мн', 'нн', 'рн', 'сн', 'тн', 'фн', 'хн', 'цн', 'чн', 'шн',
                            'вп', 'йп', 'лп', 'мп', 'нп', 'пп', 'рп', 'сп', 'хп', 'шп',
                            'бр', 'вр', 'гр', 'др', 'жр', 'зр', 'кр', 'мр', 'нр', 'пр', 'рр', 'ср', 'тр', 'фр', 'хр', 'чр', 'шр',
                            'бс', 'вс', 'гс', 'дс', 'йс', 'кс', 'лс', 'мс', 'нс', 'пс', 'рс', 'сс', 'тс', 'фс', 'хс', 'цс', 'чс', 'шс',
                            'вт', 'жт', 'зт', 'йт', 'кт', 'лт', 'мт', 'нт', 'пт', 'рт', 'ст', 'тт', 'фт', 'хт', 'цт', 'чт', 'шт',
                            'зф', 'йф', 'кф', 'лф', 'мф', 'нф', 'пф', 'рф', 'сф', 'тф', 'фф', 'шф',
                            'бх', 'вх', 'гх', 'дх', 'жх', 'зх', 'йх', 'кх', 'лх', 'мх', 'нх', 'пх', 'рх', 'сх', 'тх', 'фх', 'хх', 'чх', 'шх',
                            'дц', 'йц', 'кц', 'лц', 'мц', 'нц', 'пц', 'рц', 'тц', 'шц',
                            'дч', 'йч', 'кч', 'лч', 'мч', 'нч', 'пч', 'рч', 'фч', 'шч',
                            'бш', 'вш', 'дш', 'йш', 'кш', 'лш', 'мш', 'нш', 'пш', 'рш', 'сш', 'тш', 'фш', 'шш']
    MIDDLECOMBOS =         [x for x in LEFTCOMBOS if x in RIGHTCOMBOS]
    
    possible_names_templates = [
        'CV', 'CV', 'CV', 'CV', 'CV', 'CV', 'CV', 'CV', 'CV', 'CV',
        'VC', 'VC', 'VC', 'VC', 'VC', 'VC', 'VC', 'VC', 'VC', 'VC',
        'VCь', 'VCь', 'VCь', 'VCь', 'VCь', 'VCь', 'VCь', 'VCь', 'VCь', 'VCь',
        'CVC', 'CVC', 'CVC', 'CVC', 'CVC', 'CVC', 'CVC', 'CVC', 'CVC', 'CVC',
        'CVCь', 'CVCь', 'CVCь', 'CVCь', 'CVCь', 'CVCь', 'CVCь', 'CVCь', 'CVCь', 'CVCь',
        'CVR', 'CVM',
        'LVC', 'MVC',
        'LV', 'MV', 'VR', 'VM',
        'LVR', 'MVR', 'LVM', 'MVM'
    ]
    
    # V: Vowel
    # C: Consontant
    # L: Left-to-vowel-combo
    # M: Any-side-to-vowel-combo
    # R: Right-to-vowel-combo
    selected_template = choice(possible_names_templates)
    R = ''
    for letter in selected_template:
        if letter == 'C':
            R += choice(CONSONTANTS)
        elif letter == 'V':
            R += choice(VOWELS)
        elif letter == 'L':
            R += choice(LEFTCOMBOS)
        elif letter == 'M':
            R += choice(MIDDLECOMBOS)
        elif letter == 'R':
            R += choice(RIGHTCOMBOS)
        else:
            R += letter

    return R

def generate_shadowdayplopyname_russian():
    A = generate_dayplopynamepart_russian()
    A += A[::-1]
    R = A.capitalize() + "-" + generate_dayplopynamepart_russian().capitalize()
    return R

def main(*args):
    return generate_shadowdayplopyname_russian()
